app/Controllers/Ketos.php

SELECT *
FROM `ketos`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `ketos`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_ketos') ? $this->request->getVar('page_ketos') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword) {
            $ketos = $this->ketosModel->search($keyword);
        } else {
            $ketos = $this->ketosModel;
        }
        $data = [
            'title' => 'Daftar Kandidat',
            //$buku = $this->bukuModel->findAll();
            'ketos' => $ketos->paginate(6, 'ketos'),