app/Controllers/Orang.php

SELECT *
FROM `orang`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `orang`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_orang') ? $this->request->getVar('page_orang') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword) {
            $orang = $this->orangModel->search($keyword);
        } else {
            $orang = $this->orangModel;
        }
        $data = [
            'title' => 'Daftar Orang',
            //'orang' => $this->orangModel->findAll()
            'orang' => $orang->paginate(6, 'orang'),