app/Models/KetosModel.php

SELECT *
FROM `ketos`
WHERE `slug` = 'marklee'
 LIMIT 1
---
    public function getKetos($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }
        return $this->where(['slug' => $slug])->first();